       IDENTIFICATION DIVISION.
       PROGRAM-ID. ARITHMETIC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WS-TOTAL PIC 9(5) VALUE 100.
       PROCEDURE DIVISION.
       MAIN-PARA.
           ADD 50 TO WS-TOTAL.
           SUBTRACT 25 FROM WS-TOTAL.
           STOP RUN.
