       IDENTIFICATION DIVISION.
       PROGRAM-ID. BARE-STMTS.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WS-A PIC 9(3) VALUE 100.
       PROCEDURE DIVISION.
           COMPUTE WS-A = WS-A + 50.
           DISPLAY WS-A.
           STOP RUN.
