       IDENTIFICATION DIVISION.
       PROGRAM-ID. CURRSIGN.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           CURRENCY SIGN IS "W".
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-AMT      PIC WW,WWW.99.
       PROCEDURE DIVISION.
       MAIN-PARA.
           STOP RUN.
