       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXECSQLWS.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-COUNT       PIC 9(3) VALUE ZERO.
           EXEC SQL
                DECLARE C-TR-TYPE-FORWARD CURSOR FOR
                    SELECT TR_TYPE FROM CARDDEMO.TRANSACTION_TYPE
                    ORDER BY TR_TYPE
           END-EXEC.
       PROCEDURE DIVISION.
           ADD 1 TO WS-COUNT.
           STOP RUN.
