       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXECSQLLK.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-COUNT       PIC 9(3) VALUE ZERO.
       LINKAGE SECTION.
       01 LK-KEY         PIC X(2).
           EXEC SQL
                DECLARE C-LK-CURSOR CURSOR FOR
                    SELECT TR_TYPE FROM CARDDEMO.TRANSACTION_TYPE
           END-EXEC.
       PROCEDURE DIVISION USING LK-KEY.
           ADD 1 TO WS-COUNT.
           GOBACK.
