       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXECSQLLS.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-COUNT       PIC 9(3) VALUE ZERO.
       LOCAL-STORAGE SECTION.
       01 LS-COUNT       PIC 9(3) VALUE ZERO.
           EXEC SQL
                DECLARE C-LS-CURSOR CURSOR FOR
                    SELECT TR_TYPE FROM CARDDEMO.TRANSACTION_TYPE
           END-EXEC.
       PROCEDURE DIVISION.
           ADD 1 TO WS-COUNT.
           STOP RUN.
