       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WS-MSG PIC X(11) VALUE 'HELLO WORLD'.
       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY WS-MSG.
           STOP RUN.
