       IDENTIFICATION DIVISION.
       PROGRAM-ID. LINKAGE-WS-TEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WS-RESULT   PIC 9(5).
       LINKAGE SECTION.
       01 LS-INPUT    PIC X(10).
       PROCEDURE DIVISION USING LS-INPUT.
           MOVE 99999 TO WS-RESULT.
           STOP RUN.
