       IDENTIFICATION DIVISION.
       PROGRAM-ID. LINKAGE-TEST.
       DATA DIVISION.
       LINKAGE SECTION.
       01 LS-INPUT    PIC X(10).
       01 LS-OUTPUT   PIC 9(5).
       PROCEDURE DIVISION USING LS-INPUT GIVING LS-OUTPUT.
           MOVE 12345 TO LS-OUTPUT.
           STOP RUN.
