       IDENTIFICATION DIVISION.
       PROGRAM-ID. LOCAL-STORAGE-TEST.
       DATA DIVISION.
       LOCAL-STORAGE SECTION.
       01 LS-COUNT    PIC 9(3) VALUE ZERO.
       PROCEDURE DIVISION.
           ADD 1 TO LS-COUNT.
           STOP RUN.
