       IDENTIFICATION DIVISION.
       PROGRAM-ID. MOVE-FIELDS.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WS-SRC PIC 9(3) VALUE 123.
       77 WS-DST PIC 9(3).
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE WS-SRC TO WS-DST.
           STOP RUN.
