       IDENTIFICATION DIVISION.
       PROGRAM-ID. XMLGEN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WRITE-REC PIC X(200).
       01 WS-XML-LEN PIC 9(4).
       01 WS-FAILED PIC X.
       01 SOME-RECORD.
          05 SOME-FIELD PIC X(10).
       PROCEDURE DIVISION.
           XML GENERATE WRITE-REC FROM SOME-RECORD.
           XML GENERATE WRITE-REC FROM SOME-RECORD
               COUNT IN WS-XML-LEN
               ON EXCEPTION MOVE 'Y' TO WS-FAILED
               NOT ON EXCEPTION MOVE 'N' TO WS-FAILED
           END-XML.
           STOP RUN.
